In [1]:
import pandas as pd

In [2]:
# Reading local and global temp data
local_temp_data = pd.read_csv('local_temp_data.csv')
global_temp_data = pd.read_csv('global_temp_data.csv')

In [3]:
local_temp_data.head()

   year       city country  avg_temp
0  1796  Hyderabad   India     26.53
1  1797  Hyderabad   India     27.48
2  1798  Hyderabad   India     26.20
3  1799  Hyderabad   India     26.84
4  1800  Hyderabad   India     26.88

In [4]:
global_temp_data.head()

   year  avg_temp
0  1750      8.72
1  1751      7.98
2  1752      5.78
3  1753      8.39
4  1754      8.47